package ui;

public abstract class MenuStrings {
    static String m =
            """
                    1 - Вывести галлерею
                    2 - Создать новый бургер
                    0 - Выход
                    """;

    static String m2 =
            """
                    1 - Добавить булку
                    2 - Добавить котлету
                    3 - Добавить соус
                    4 - Добавить овощи
                    5 - Убрать корку у булки
                    6 - Убрать кунжут у булки
                    7 - Выбрать размер
                    8 - Собрать и сохранить
                    0 - Вернуться
                    """;

    static String m21 =
            """
                    1 - Белый хлеб
                    2 - Ржаной хлеб
                    0 - Вернуться
                    """;

    static String m22 =
            """
                    1 - Курица
                    2 - Свинина
                    3 - Говядина
                    0 - Вернуться
                    """;

    static String m23 =
            """
                    1 - Соус сырный
                    2 - Соус кисло-сладкий
                    3 - Соус "сальса"
                    0 - Вернуться
                    """;

    static String m23x =
            """
                    1 - Добавить еще
                    2 - Убрать лишнее
                    3 - Оставить как есть
                    """;
    static String m24 =
            """
                    1 - Добавить томаты (в зависимости от размера бургера)
                    2 - Добавить огурцы (в зависимости от размера бургера)
                    0 - Вернуться
                    """;

    static String m27 =
            """
                    1 - Маленький
                    2 - Стандартный
                    3 - Большой
                    4 - Экстра-большой
                    5 - Гигант
                    6 - Длинный
                    7 - Экстра-длинный
                    0 - Вернуться
                    """;

    static String m25 = "Корка убрана";
    static String m26 = "Кунжут убран";

    static String mError = "Невалидный аргумент";
    static String mAdded = "Элемент добавлен";
    static String mAdd = "Введите количество элементов";
}
